# Напишите программу, которая, получает на вход 2 числа (большее и меньшее). Определить, кратно ли первое
# число второму. Вывести на экран сообщение об этом, а также остаток от деления, если первое число не кратно второму
# num_1 = int(input("Введитe большее число: "))
# num_2: int = int(input("Введитe меньшее число: "))
# if num_1 % 2 == 0:
#    print("Первое число кратно второму")
# elif num_1 == num_2:
#    print("Они равны друг другу")
# else:
#    остаток = num_1 % num_2
#    print(f"{num_1} не кратно {num_2}")
#    print(f"Остаток от деления: {остаток}")