# Напишите программу, которая из введенной пользователем строки создаст список. Удалить из этого списка
# все буквы ‘a’, ‘e’, ‘u’. Строка вводится
# на английском и символы для удаления так же на английском языке.
a_1 = str(input())
b_1 = list(a_1)
print(b_1)
b_1.remove('a')
b_1.remove('e')
b_1.remove('u')
print(b_1)







