#1
#Напишите программу, которая определяет наибольшее и наименьшее из двух чисел, введенных пользователем.
#number_1 = int(input("Введитe первое число: "))
#number_2 = int(input("Введите второе число: "))
#max = max(number_1, number_2)
#min = min(number_1, number_2)
#print("Наибольшее число: ", max)
#print("Наименьшее число: ", min)


#2
# Напишите программу, которая проверяет является ли введенное пользователем число четным
#if number % 2 == 0:
#    print("Число четное ")
#else:
#    print("Число нечетное ")


#3
#Напишите программу, которая, получает на вход 2 числа (большее и меньшее). Определить, кратно ли первое
#число второму. Вывести на экран сообщение об этом, а также остаток от деления, если первое число не кратно второму
#num_1 = int(input("Введитe большее число: "))
#num_2: int = int(input("Введитe меньшее число: "))
#if num_1 % 2 == 0:
#    print("Первое число кратно второму")
#elif num_1 == num_2:
#    print("Они равны друг другу")
#else:
#    остаток = num_1 % num_2
#    print(f"{num_1} не кратно {num_2}")
#    print(f"Остаток от деления: {остаток}")





