# 9. Напишите функцию, которая принимает список чисел и возвращает новый список, содержащий
# только числа в диапазоне от 5 до 10, используя lambda функцию.
# def filter_numbers(number):
#    return list(filter(lambda x: 5 <= x <= 10, number))

# numbers = [1, 12, 8, 4, 9, 11, 7]
# print(filter_numbers(numbers))