# Напишите программу, которая, получает на вход три числа. Выведите сумму наибольшего и наименьшего из трёх чисел.

a = int(input())
b = int(input())
c = int(input())
d = min(a, b, c)
e = max(a, b, c)
num = d + e
print(num)







