# Напишите программу, которая получает на вход строку и выводит:Третий символ этой строки
a = "Pruvet"
print(a[2])
