# 3. Напишите функцию, которая принимает список строк и возвращает новый список, содержащий
# только строки длиной больше 3 символов, используя lambda функцию.
# def filter_strings(strings):
#    return list(filter(lambda x: len(x) > 3, strings))
# strings = ["sds", "er", "weetr"]
# filtered_strings = filter_strings(strings)
# print(filtered_strings)