# Напишите программу, которая проверяет является ли введенное пользователем число четным.
number = int(input("Введите число: "))
if number % 2 == 0:
    print("Это четное число")
else:
    print("Это не четное число")
