# 7. Напишите функцию, которая принимает список строк и возвращает новый список, содержащий
# только строки в верхнем регистре, используя lambda функцию.
# def to_uppercase(strings):
#    return list(filter(lambda x: x.isupper(), strings))


# strings = ["ETRE", "ddfd", "Rfhh", "Tuuy", "TYTYUT"]
# print(to_uppercase(strings))