# Напишите программу, которая, получает на вход целое положительное
# число с клавиатуры. Необходимо вывести все числа от 0 до N (N - Это введенное число), используя цикл while.
number = int(input())
n = 0
while n <= number:
    print(n)
    n += 1
