# 10. Напишите функцию, которая принимает список строк и возвращает новый список, содержащий только
# строки, оканчивающиеся на букву "о", используя lambda функцию.
# def filter_words(word_list):
#     return list(filter(lambda word: word.endswith('o'), word_list))


# words = ["alenjbo", "bftfugo", "Ant", "dogpo", "Adfddg"]
# filtered_words = filter_words(words)
# print(filtered_words)
