# 5.Напишите функцию, которая принимает список слов и возвращает новый список, содержащий
# только слова, начинающиеся с буквы "а" или “A”, используя lambda функцию.
# def filter_words(word_list):
#    return list(filter(lambda word: word[0].lower() == 'a', word_list))
# words = ["alenjbj", "bftfugu", "Ant", "dog", "Adfddg"]
# filtered_words = filter_words(words)
# print(filtered_words)