# Напишите программу, которая запрашивает число и организовывает следующий вывод:
# Введенное число: X, число меньше на 5: X-5, число большее на 12.5: X+12.5
a = int(input("Введите число: "))
print(a, a - 5, a + 12.5, sep=',')



