# Написать программу, создающую список из введенной пользователем строки цифр (без пробелов). Вывести все
#  элементы строки, которые имеют нечетные индексы.
s_1 = list(input())
print(s_1)
print((s_1)[1::2])
